# DATAFRAME

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
a= pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [4]:
a

Empty DataFrame
Columns: []
Index: []

In [5]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [6]:
type(b)

pandas.core.frame.DataFrame

In [7]:
c= pd.DataFrame([ [1,2,4]   ,   [10,20,1]     , [11,22,33]  ])

In [8]:
c

    0   1   2
0   1   2   4
1  10  20   1
2  11  22  33

In [9]:
type(c)

pandas.core.frame.DataFrame

In [10]:
d= pd.DataFrame([[1,2,3,34,4],[10,20,15,1,2],[11,22,33,12,12],[13,34,34,24,34],[14,12,1,12,31]])

In [11]:
d

    0   1   2   3   4
0   1   2   3  34   4
1  10  20  15   1   2
2  11  22  33  12  12
3  13  34  34  24  34
4  14  12   1  12  31

In [12]:
c.head()

    0   1   2
0   1   2   4
1  10  20   1
2  11  22  33

In [13]:
c.tail()

    0   1   2
0   1   2   4
1  10  20   1
2  11  22  33

In [14]:
d.head(2)

    0   1   2   3  4
0   1   2   3  34  4
1  10  20  15   1  2

In [15]:
d.tail(3)

    0   1   2   3   4
2  11  22  33  12  12
3  13  34  34  24  34
4  14  12   1  12  31

In [16]:
c.sample()

    0   1   2
2  11  22  33

In [17]:
c.sample(2)

    0   1   2
2  11  22  33
1  10  20   1

In [18]:
d= pd.DataFrame([[1,34,4],[10,np.nan,23,2],['Missing',22,np.nan,12],[13,34],[14,12,1,12,31]])

In [19]:
d

         0     1     2     3     4
0        1  34.0   4.0   NaN   NaN
1       10   NaN  23.0   2.0   NaN
2  Missing  22.0   NaN  12.0   NaN
3       13  34.0   NaN   NaN   NaN
4       14  12.0   1.0  12.0  31.0

In [20]:
d

         0     1     2     3     4
0        1  34.0   4.0   NaN   NaN
1       10   NaN  23.0   2.0   NaN
2  Missing  22.0   NaN  12.0   NaN
3       13  34.0   NaN   NaN   NaN
4       14  12.0   1.0  12.0  31.0

In [21]:
d

         0     1     2     3     4
0        1  34.0   4.0   NaN   NaN
1       10   NaN  23.0   2.0   NaN
2  Missing  22.0   NaN  12.0   NaN
3       13  34.0   NaN   NaN   NaN
4       14  12.0   1.0  12.0  31.0

In [22]:
d

         0     1     2     3     4
0        1  34.0   4.0   NaN   NaN
1       10   NaN  23.0   2.0   NaN
2  Missing  22.0   NaN  12.0   NaN
3       13  34.0   NaN   NaN   NaN
4       14  12.0   1.0  12.0  31.0

In [23]:
d

         0     1     2     3     4
0        1  34.0   4.0   NaN   NaN
1       10   NaN  23.0   2.0   NaN
2  Missing  22.0   NaN  12.0   NaN
3       13  34.0   NaN   NaN   NaN
4       14  12.0   1.0  12.0  31.0

In [24]:
d= pd.DataFrame([[1,2,3,34,4],[10,20,15,1,2],[11,22,33,12,12],[13,34,34,24,34],[14,12,1,12,31]],columns=['col a', 'col b', 'col c', 'col c', 'col d'])

In [25]:
d

   col a  col b  col c  col c  col d
0      1      2      3     34      4
1     10     20     15      1      2
2     11     22     33     12     12
3     13     34     34     24     34
4     14     12      1     12     31

In [26]:
d[['col a' , 'col b']].head(3)

   col a  col b
0      1      2
1     10     20
2     11     22

In [27]:
c.head(3)

    0   1   2
0   1   2   4
1  10  20   1
2  11  22  33

In [28]:
d.head(2)

   col a  col b  col c  col c  col d
0      1      2      3     34      4
1     10     20     15      1      2

In [29]:
d.shape

(5, 5)

In [30]:
d['col a'].max()

14

In [31]:
d['new_column']= [1,2,3,43,45]

In [32]:
d

   col a  col b  col c  col c  col d  new_column
0      1      2      3     34      4           1
1     10     20     15      1      2           2
2     11     22     33     12     12           3
3     13     34     34     24     34          43
4     14     12      1     12     31          45

In [33]:
d['new_column 2']= [12,32,4,3,45]

In [34]:
d

   col a  col b  col c  col c  col d  new_column  new_column 2
0      1      2      3     34      4           1            12
1     10     20     15      1      2           2            32
2     11     22     33     12     12           3             4
3     13     34     34     24     34          43             3
4     14     12      1     12     31          45            45

In [35]:
d['new column 3'] = d['new_column'] + d['new_column 2']

In [36]:
d

   col a  col b  col c  col c  col d  new_column  new_column 2  new column 3
0      1      2      3     34      4           1            12            13
1     10     20     15      1      2           2            32            34
2     11     22     33     12     12           3             4             7
3     13     34     34     24     34          43             3            46
4     14     12      1     12     31          45            45            90

In [37]:
a= d['new column 3'] >30

In [38]:
a

0    False
1     True
2    False
3     True
4     True
Name: new column 3, dtype: bool

In [39]:
d[a]

   col a  col b  col c  col c  col d  new_column  new_column 2  new column 3
1     10     20     15      1      2           2            32            34
3     13     34     34     24     34          43             3            46
4     14     12      1     12     31          45            45            90

In [40]:
d['col a']

0     1
1    10
2    11
3    13
4    14
Name: col a, dtype: int64